In [4]:
import pandas as pd

df = pd.read_excel('user_data.xlsx')
display(df) #見やすく表示される

  Unnamed: 0      name  age address blood type
0       id-1     Yujin   25   Korea          A
1       id-2  Xiaoting   22   China         AB
2       id-3    hikaru   17   Japan          O

In [5]:
df = pd.read_csv('user_data.csv')
display(df)

   user id       name  age address blood type
0        1     Yu-Jin   25   Korea          A
1        2  Xiao-Ting   22   China         AB
2        3    Mashiro   22   Japan         AB
3        4  Chae-Hyun   19   Korea          B
4        5    Da-Yeon   18   Korea          A
5        6     Hikaru   17   Japan          O
6        7   Bahiyyih   17   Korea          A
7        8  Young-Eun   17   Korea          A
8        9     Ye-seo   16   Korea          A

In [37]:
# 特定の行や列を抽出
df.loc[[0, 8],['name', 'age']] # [インデクス値のリスト], [カラム名のリスト] すべての場合は：

     name  age
0  Yu-Jin   25
8  Ye-seo   16

In [40]:
df.loc[0:3,['name', 'age']] #0~3まで

        name  age
0     Yu-Jin   25
1  Xiao-Ting   22
2    Mashiro   22
3  Chae-Hyun   19

In [42]:
df.iloc[[2, 3], [3,4]]

  address blood type
2   Japan         AB
3   Korea          B

In [44]:
df[['name', 'age']]

        name  age
0     Yu-Jin   25
1  Xiao-Ting   22
2    Mashiro   22
3  Chae-Hyun   19
4    Da-Yeon   18
5     Hikaru   17
6   Bahiyyih   17
7  Young-Eun   17
8     Ye-seo   16

In [45]:
df['name'] #Series

0       Yu-Jin
1    Xiao-Ting
2      Mashiro
3    Chae-Hyun
4      Da-Yeon
5       Hikaru
6     Bahiyyih
7    Young-Eun
8       Ye-seo
Name: name, dtype: object

In [8]:
# 抽出条件で操作
df[df['age']>= 20]

   user id       name  age address blood type
0        1     Yu-Jin   25   Korea          A
1        2  Xiao-Ting   22   China         AB
2        3    Mashiro   22   Japan         AB

In [10]:
# 複数条件は()
df[(df['age']<=20) & (df['blood type']=='A')]

   user id       name  age address blood type
4        5    Da-Yeon   18   Korea          A
6        7   Bahiyyih   17   Korea          A
7        8  Young-Eun   17   Korea          A
8        9     Ye-seo   16   Korea          A

In [14]:
# 統計を調べる　
# 引数に numeric_only=True にしないと Warning が出る事がある
df['age'].mean()

19.22222222222222

In [13]:
df.max(numeric_only=True)

user id     9
age        25
dtype: int64

In [19]:
# 列単位で演算・加工
df['user id'] * df['age']

0     25
1     44
2     66
3     76
4     90
5    102
6    119
7    136
8    144
dtype: int64

In [20]:
# 結果を新しく列に追加
df['new data'] = df['user id'] * df['age']
display(df)

   user id       name  age address blood type  new data
0        1     Yu-Jin   25   Korea          A        25
1        2  Xiao-Ting   22   China         AB        44
2        3    Mashiro   22   Japan         AB        66
3        4  Chae-Hyun   19   Korea          B        76
4        5    Da-Yeon   18   Korea          A        90
5        6     Hikaru   17   Japan          O       102
6        7   Bahiyyih   17   Korea          A       119
7        8  Young-Eun   17   Korea          A       136
8        9     Ye-seo   16   Korea          A       144